Public Attributes | List of all members
API_CalcUnitPrefs Struct Reference
Project Settings
The representation of the Project Preferences / Calculation Units Rules tab page. More...
#include <APIdefs_Environment.h>
 Public Attributes
API_CalcLengthFormat  | length
Length preferences.
API_CalcAreaFormat  | area
Area preferences.
API_CalcVolumeFormat  | volume
Volume preferences.
API_CalcAngleFormat  | angle
Angle preferences.
bool  | useDisplayedValues
Represents the "Calculate Totals by" RadioButton. true means that Archicad should use the displayed values in calculations. This way the calculations can be verified manually. false means that Archicad should use the exact values (in double precision) in calculations.
Detailed Description
The representation of the Project Preferences / Calculation Units Rules tab page.
Remarks
This structure is used by the ACAPI_ProjectSetting_GetPreferences function to get the settings of the Calculation Units Rules preferences page.
Member Data Documentation
◆ angle
 API_CalcUnitPrefs::angle
Angle preferences.
◆ area
 API_CalcUnitPrefs::area
Area preferences.
◆ length
 API_CalcUnitPrefs::length
Length preferences.
◆ useDisplayedValues
 API_CalcUnitPrefs::useDisplayedValues
Represents the "Calculate Totals by" RadioButton. true means that Archicad should use the displayed values in calculations. This way the calculations can be verified manually. false means that Archicad should use the exact values (in double precision) in calculations.
◆ volume
 API_CalcUnitPrefs::volume
Volume preferences.